EDT/УТ/src/Documents/упрПлатежноеПоручение/упрПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>упрПлатежноеПоручение</name>
  <attributes>
    <name>ЗаписьРасхода</name>
    <type>
      <types>DocumentRef.упрЗаписьРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежаМаксимальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхБазы1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПП_БП</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПП_БП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/Documents/упрПлатежноеПоручение/Forms/ФормаВводаНовогоДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеЗаполнения = Неопределено;
	Если Параметры.Свойство("ДанныеЗаполнения", ДанныеЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Сейчас = ТекущаяДата();
	Сегодня = НачалоДня(Сейчас);
	
	Если Не Объект.СуммаПлатежа Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле ""Сумма платежа"" не заполнено";
		Сообщение.Поле = "СуммаПлатежа";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Объект.СуммаПлатежа > Объект.СуммаПлатежаМаксимальная Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = """Сумма платежа"" превышет Максимальную";
		Сообщение.Поле = "СуммаПлатежа";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаПлатежа) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле ""Дата платежа"" не заполнено";
		Сообщение.Поле = "ДатаПлатежа";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Объект.ДатаПлатежа < Сегодня Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = """Дата платежа"" не может быть раньше текущего дня";
		Сообщение.Поле = "ДатаПлатежа";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаксСуммаПлатежа(Команда)
	
	Объект.СуммаПлатежа = Объект.СуммаПлатежаМаксимальная;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Вы действительно хотите отменить создание платежа?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПП_БП) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Объект.Ссылка);
	
	ФоновыеЗадания.Выполнить("УправленческийУчетСервер.СоздатьПлатежноеПоручениеБП", МассивПараметров, , );
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Закрыть();
	
КонецПроцедуры
